module Streams_Test where

import Test.HUnit
import Streams   -- Променете името на модула, който се включва така,
            -- че тук да се зарежда модулът с вашето решение.
            -- Например ако модулът с решението ви се казва K3_12345,
            -- променете реда на import K3_12345
            -- (Можете да изтриете този коментар след като направите промените)

-- Даденият по-долу пример е само ориентировъчен.
-- Когато решавате задачите си, можете да го изтриете
-- или да го промените така, че да проверява условия
-- свързани с вашия код.

-- ...или съкратената форма
-- 1 2 3 4 5 6 7 8 9 10 11
-- 1 2 2 3 3 4 4 4 5 5  5 

test1 = "seq works correctly" ~: [1,2,2,3,3,4,4,4,5,5,5] ~=? take 11 seq'

test2 = "sumLast works correctly" ~: [3, 3, 6, 12, 24, 48, 93, 183] ~=? take 8 (sumLast 3 5)

tl1 = TestList [test1]
tl2 = TestList [test2]

main = do
  runTestTT tl1
  runTestTT tl2
